In [ ]:
pip install django

In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [18]:
from django.db import transaction, DatabaseError
try:
    a.save()
except DatabaseError:
    transaction.rollback()

NameError: name 'a' is not defined

In [2]:
order_df = pd.read_csv("orders.csv").sample(10000)

In [3]:
order_df.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2918443,152642,176070,prior,1,1,9,NaN
1012121,841291,60807,prior,22,5,17,2.0
3194482,65868,192609,prior,6,0,8,8.0
2049452,1344622,123154,prior,35,0,13,7.0
1892509,1295749,113616,prior,2,0,12,2.0

In [86]:
aisle_df = pd.read_csv("aisles.csv")
dept_df = pd.read_csv("departments.csv")
order_pro_df = pd.read_csv("order_product.csv").sample(10000)
product_df = pd.read_csv("products.csv")

In [5]:
aisle_df.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [6]:
dept_df.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [87]:
order_pro_df.head()

          order_id  product_id  add_to_cart_order  reordered
24470016   2580780         881                  4          0
12994774   1371650       24838                  1          1
4330719     457132         219                 16          1
19161592   2021026       30489                 10          1
31067083   3276974       42701                  4          1

In [8]:
product_df.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [9]:
try:
    conn = psycopg2.connect(dbname='dball', user='postgres', password='devon', port='5432')
except:
    print("connection was unsuccesful")

In [10]:
cur = conn.cursor()

In [80]:
engine = create_engine('postgresql+psycopg2://postgres:devon@localhost/dball')

In [83]:
curs = conn.cursor()
curs.execute("ROLLBACK")
conn.commit()

In [81]:
cur.execute("""
CREATE TABLE aisles (
    aisle_id INTEGER PRIMARY KEY,
    aisle VARCHAR(255)
)
""")

DuplicateTable: relation "aisles" already exists

In [55]:
cur.execute("""
    CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department VARCHAR(255)
    ) 
""")

In [56]:
cur.execute("""
    CREATE TABLE products (
    product_id INTEGER PRIMARY KEY,
    product_name VARCHAR(255),
    aisle_id INTEGER,
    department_id INTEGER,
    FOREIGN KEY(aisle_id) REFERENCES aisles(aisle_id), 
    FOREIGN KEY(department_id) REFERENCES departments(department_id)
    ) 
""")

In [57]:
cur.execute("""
    CREATE TABLE orders (
    order_id INTEGER PRIMARY KEY,
    user_id INTEGER,
    order_number INTEGER,
    order_dow INTEGER,
    order_hour_of_day INTEGER,
    days_since_prior_order INTEGER
    ) 
""")

In [58]:
cur.execute("""
    CREATE TABLE order_product (
    order_id INTEGER,
    product_id INTEGER,
    add_to_cart_order INTEGER,
    reordered INTEGER,
    PRIMARY KEY(order_id, product_id),
    FOREIGN KEY(order_id) REFERENCES orders(order_id), 
    FOREIGN KEY(product_id) REFERENCES products(product_id)
       
    ) 
""")

In [60]:
conn.commit()

In [61]:
order_df.drop('eval_set', inplace=True, axis=1)

In [65]:
aisle_df.to_sql('aisles', con=engine, if_exists='append', index=False)

134

In [67]:
dept_df.to_sql('departments', con=engine, if_exists='append', index=False)

21

In [68]:
product_df.to_sql('products', con=engine, if_exists='append', index=False)

688

In [69]:
order_df.to_sql('orders', con=engine, if_exists='append', index=False)

1000

In [91]:
order_pro_df.to_sql('order_product', con=engine, if_exists='replace', index=False)

1000